# 4.9. 
# 4.9 IC Intro to Data Visualization with Python Part1
# Contents
## 1. Import libraries&data sets
## 2. Wrangle the data so that it follows consistent logic.
## 3. Data quality and consistency checks.
## 4. Combine customer data with the rest of prepared Instacart data. 
## 5. Export the new dataframe as a pickle file so you can continue to use it in the second part of this task.

## 1. Import libraries&data sets

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [3]:
# Create project folder path
path=r'/Users/yevgeniyaem/Documents/Weiterbildung Data Analytics/11-2024 Instacart Basket Analysis'

In [5]:
path

'/Users/yevgeniyaem/Documents/Weiterbildung Data Analytics/11-2024 Instacart Basket Analysis'

In [7]:
# Import "customers.csv"
customers=pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

In [9]:
# Check the output
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

## 2. Wrangle the data so that it follows consistent logic.

In [11]:
# Check the df
customers.shape

(206209, 10)

In [13]:
customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [15]:
customers.columns

Index(['user_id', 'First Name', 'Surnam', 'Gender', 'STATE', 'Age',
       'date_joined', 'n_dependants', 'fam_status', 'income'],
      dtype='object')

In [17]:
# Rename columns
customers = customers.rename(columns={ 
    'First Name' : 'first_name',
    'Surnam' : 'last_name', 
    'Gender' : 'gender',
    'STATE' : 'state', 
    'Age' : 'age',
    'date_joined' : 'date_joined', 
    'n_dependants' : 'number_of_dependants',
    'fam_status' : 'family_status'})

In [19]:
# Check the result
customers.head()

,user_id,first_name,last_name,gender,state,age,date_joined,number_of_dependants,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [ ]:
#### No more wrangling actions necessary. All retainig columns are important for the analysis.

## 3. Data quality and consistency checks.

In [21]:
# Address data-types and potential mixed data-types in the dataframe
customers.dtypes

user_id                  int64
first_name              object
last_name               object
gender                  object
state                   object
age                      int64
date_joined             object
number_of_dependants     int64
family_status           object
income                   int64
dtype: object

In [23]:
# Checking for mixed data-types in each column
for col in customers.columns.tolist():
  weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

first_name

In [ ]:
### the column first_name contains mixed data-types. as next step i'll check if there are missing values

In [25]:
# Finding missing values
missing_values = customers.isnull().sum()

In [27]:
missing_values

user_id                     0
first_name              11259
last_name                   0
gender                      0
state                       0
age                         0
date_joined                 0
number_of_dependants        0
family_status               0
income                      0
dtype: int64

In [29]:
# Finding missing values in the column first_name
missing_value_2 = customers['first_name'].isnull().sum()

In [31]:
missing_value_2

11259

In [33]:
# Display rows with missing first_name values
missing_value_2 = customers[customers['first_name'].isnull()]

In [35]:
print(missing_value_2)

        user_id first_name last_name  gender         state  age date_joined  \
53        76659        NaN   Gilbert    Male      Colorado   26    1/1/2017
73        13738        NaN     Frost  Female     Louisiana   39    1/1/2017
82        89996        NaN    Dawson  Female        Oregon   52    1/1/2017
99        96166        NaN   Oconnor    Male      Oklahoma   51    1/1/2017
105       29778        NaN    Dawson  Female          Utah   63    1/1/2017
...         ...        ...       ...     ...           ...  ...         ...
206038   121317        NaN    Melton    Male  Pennsylvania   28   3/31/2020
206044   200799        NaN  Copeland  Female        Hawaii   52    4/1/2020
206090   167394        NaN     Frost  Female        Hawaii   61    4/1/2020
206162   187532        NaN     Floyd  Female    California   39    4/1/2020
206171   116898        NaN   Delgado  Female      Colorado   23    4/1/2020

        number_of_dependants family_status  income
53                         2       married   41709
73                         0        single   82518
82                         3       married  117099
99                         1       married  155673
105                        3       married  151819
...                      ...           ...     ...
206038                     3       married   87783
206044                     2       married  108488
206090                     1       married   45275
206162                     0        single   56325
206171                     2       married   59222

[11259 rows x 10 columns]

In [ ]:
### didn't recognize any pattern in missing values.

In [37]:
# Check the unique data types in the column
print(customers['first_name'].apply(type).value_counts())

first_name
<class 'str'>      194950
<class 'float'>     11259
Name: count, dtype: int64

In [ ]:
### missing values contain more than 5% of the whole customers count, 
### so the suitable solution is here to handle the missing value is to impute them with "unknown value"

In [39]:
# Imputing missing values with "unknown"
customers['first_name'].fillna('Unknown', inplace=True)

/var/folders/gn/b13h25pn5k1500kc2862p30r0000gp/T/ipykernel_1897/1059873430.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  customers['first_name'].fillna('Unknown', inplace=True)

In [41]:
# Verify the updates
print(customers['first_name'].isnull().sum())  # Should return 0 missing values

0

In [43]:
# Ensure all data types are consistent
print(customers['first_name'].apply(type).value_counts())

first_name
<class 'str'>    206209
Name: count, dtype: int64

In [45]:
# Finding duplicates
dups_customer = customers[customers.duplicated()]

In [47]:
dups_customer

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, number_of_dependants, family_status, income]
Index: []

In [ ]:
#### there are no duplicates found

In [49]:
# Re-check the data-types in the data frame and for mixed data-types
customers.dtypes

user_id                  int64
first_name              object
last_name               object
gender                  object
state                   object
age                      int64
date_joined             object
number_of_dependants     int64
family_status           object
income                   int64
dtype: object

In [51]:
for col in customers.columns.tolist():
  weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

In [ ]:
#### no mixed data type identified

In [53]:
# Check for missing data
customers.isnull().sum()

user_id                 0
first_name              0
last_name               0
gender                  0
state                   0
age                     0
date_joined             0
number_of_dependants    0
family_status           0
income                  0
dtype: int64

In [55]:
# Perform a descriptive statistic check to ensure everything looks normal
customers.describe()

             user_id            age  number_of_dependants         income
count  206209.000000  206209.000000         206209.000000  206209.000000
mean   103105.000000      49.501646              1.499823   94632.852548
std     59527.555167      18.480962              1.118433   42473.786988
min         1.000000      18.000000              0.000000   25903.000000
25%     51553.000000      33.000000              0.000000   59874.000000
50%    103105.000000      49.000000              1.000000   93547.000000
75%    154657.000000      66.000000              3.000000  124244.000000
max    206209.000000      81.000000              3.000000  593901.000000

In [ ]:
####  There's nothing unusual present in the descriptive statistics

## 4. Combine customer data with the rest of prepared Instacart data.

In [57]:
# Import of the prepared data "ords_prods_merged_grouped.pkl"
ords_prods=pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged_grouped.pkl'))

In [59]:
# Check the shape of the newly imported dataframe
ords_prods.shape

(32404859, 19)

In [61]:
# Check the data type of columns
ords_prods.dtypes

order_id                       object
user_id                         int64
customers_order_count           int64
orders_day_of_week              int64
order_hour_of_day               int64
days_since_prior_order        float64
product_id                      int64
add_to_cart_order               int64
reordered                       int64
product_name                   object
aisle_id                        int64
department_id                   int64
prices                        float64
max_order                       int64
loyalty_flag                   object
spending_flag                  object
avg_user_price                float64
median_days_between_orders    float64
frequency_flag                 object
dtype: object

In [ ]:
###### Key column of both data frames is user_id, in both data frames are int64 data type. The combining of data with the default join (inner) can be provided.

In [63]:
# Merging if both data frames
orders_products_all = ords_prods.merge(customers, on = 'user_id', indicator = True)

In [64]:
# Check the result
orders_products_all.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 29 columns):
 #   Column                      Dtype
---  ------                      -----
 0   order_id                    object
 1   user_id                     int64
 2   customers_order_count       int64
 3   orders_day_of_week          int64
 4   order_hour_of_day           int64
 5   days_since_prior_order      float64
 6   product_id                  int64
 7   add_to_cart_order           int64
 8   reordered                   int64
 9   product_name                object
 10  aisle_id                    int64
 11  department_id               int64
 12  prices                      float64
 13  max_order                   int64
 14  loyalty_flag                object
 15  spending_flag               object
 16  avg_user_price              float64
 17  median_days_between_orders  float64
 18  frequency_flag              object
 19  first_name                  object
 20  last_name                   object
 21  gender                      object
 22  state                       object
 23  age                         int64
 24  date_joined                 object
 25  number_of_dependants        int64
 26  family_status               object
 27  income                      int64
 28  _merge                      category
dtypes: category(1), float64(4), int64(13), object(11)
memory usage: 6.8+ GB

In [67]:
# Check the head
orders_products_all.head()

,order_id,user_id,customers_order_count,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,first_name,last_name,gender,state,age,date_joined,number_of_dependants,family_status,income,_merge
0,2539329,1,1,2,8,0.0,196,1,0,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2539329,1,1,2,8,0.0,14084,2,0,Organic Unsweetened Vanilla Almond Milk,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,2539329,1,1,2,8,0.0,12427,3,0,Original Beef Jerky,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2539329,1,1,2,8,0.0,26088,4,0,Aged White Cheddar Popcorn,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,2539329,1,1,2,8,0.0,26405,5,0,XL Pick-A-Size Paper Towel Rolls,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [69]:
# Check inner join value counts
orders_products_all['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [71]:
# Droping "_merge" column 
orders_products_all=orders_products_all.drop(columns = ['_merge'])

In [73]:
# Check the output
orders_products_all.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 28 columns):
 #   Column                      Dtype
---  ------                      -----
 0   order_id                    object
 1   user_id                     int64
 2   customers_order_count       int64
 3   orders_day_of_week          int64
 4   order_hour_of_day           int64
 5   days_since_prior_order      float64
 6   product_id                  int64
 7   add_to_cart_order           int64
 8   reordered                   int64
 9   product_name                object
 10  aisle_id                    int64
 11  department_id               int64
 12  prices                      float64
 13  max_order                   int64
 14  loyalty_flag                object
 15  spending_flag               object
 16  avg_user_price              float64
 17  median_days_between_orders  float64
 18  frequency_flag              object
 19  first_name                  object
 20  last_name                   object
 21  gender                      object
 22  state                       object
 23  age                         int64
 24  date_joined                 object
 25  number_of_dependants        int64
 26  family_status               object
 27  income                      int64
dtypes: float64(4), int64(13), object(11)
memory usage: 6.8+ GB

## 5. Export the new dataframe as a pickle file so you can continue to use it in the second part of this task.

In [75]:
# Export orders_products_all as "orders_products_all.pkl"
orders_products_all.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_all.pkl'))